a = int(input())
b = int(input())

for x in range(a, b + 1):
	print(x)

#Даны два целых числа A и B (при этом A ≤ B). Выведите все числа от A до B включительно.