n = int(input())

m = 0
for x in range(n):
	l = int(input())
	if l == 0:
		m += 1
print(m)		

#Дано N чисел: сначала вводится число N, затем вводится ровно N целых чисел. Подсчитайте количество нулей среди введенных чисел и выведите это количество. 
#Вам нужно подсчитать количество чисел, равных нулю, а не количество цифр.