a = int(input())
b = int(input())

if a <= b:
	print(a)
else:
	print(b)

#Даны два целых числа. Выведите значение наименьшего из них.