a = float(input())

a *= 10
print(int(a % 10))

#Дано положительное действительное число X. Выведите его первую цифру после десятичной точки.