a = float(input())

a1 = a // 1
print(a - a1)


#Дано положительное действительное число X. Выведите его дробную часть.