a = float(input())
b = float(input())

print((a**2 + b**2)**0.5)

#Дано два числа a и b. Выведите гипотенузу треугольника с заданными катетами.