a = int(input())

a1 = a // 100
a2 = a % 10
a3 = (a // 10) % 10
print(a1 + a2 + a3)

#Дано трехзначное число. Найдите сумму его цифр.