a = int(input())

n, x = 2, 1
while n < a:
	n *= 2
	x += 1
print(x - 1, n / 2)	

#По данному натуральному числу N найдите наибольшую целую степень двойки, не превосходящую N. Выведите показатель степени и саму степень.
#Операцией возведения в степень пользоваться нельзя!