n = int(input())

x = 1
while x <= n:
	print(x**2)
	x += 1

#Даны два целых числа A и В, A>B. Выведите все нечётные числа от A до B включительно, в порядке убывания. 
#В этой задаче можно обойтись без инструкции if.