n = [1, 2, 3, 8, 5, 3, 6]
print(max(n), n.index(max(n)))


#Дан список чисел. Выведите значение наибольшего элемента в списке, а затем индекс этого элемента в списке. 
#Если наибольших элементов несколько, выведите индекс первого из них.