a = input()

a1 = a.replace("1", "one")
print(a1)

#Дана строка. Замените в этой строке все цифры 1 на слово one.